###ðŸ”¹ What is Target Guided Ordinal Encoding?

Itâ€™s a type of ordinal encoding where the order of categories is decided based on the relationship with the target variable, not just by natural order.

Instead of manually deciding the order, we look at the mean of the target variable for each category and assign numbers accordingly.

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    'city' : ['New York', 'London', 'Paris', 'Tokyo', 'New York', 'Paris'],
    'price' : [200,150,300,250,180,320]    
})

In [4]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [5]:
df.groupby('city')['price'].mean()

city
London      150.0
New York    190.0
Paris       310.0
Tokyo       250.0
Name: price, dtype: float64

In [6]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [7]:
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [8]:
df['city_encoded'] = df['city'].map(mean_price)

In [9]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0